function U = Signal(t,tau,Ui,t0)
% AVERAGE Сигнал трапециевидной формы
	[~,n] = size(t); %Определение размера входного вектора времени
    U = ones(1,n); %Создание выходного вектора
    for i = 1:n %Цикл заполнения вектора значениями
        if(((t(i)-t0)>=(-tau/2))&&((t(i)-t0)<=(-tau/4)))
            U(i) = 2*Ui*(1+2*(t(i)-t0)/tau); %Возрастание напряжения [В]
        elseif(((t(i)-t0)>=(-tau/4))&&((t(i)-t0)<=(tau/4)))
            U(i) = 2*Ui; %Стационарное напряжение [В]
        elseif(((t(i)-t0)>=(tau/4))&&((t(i)-t0)<=(tau/2)))
            U(i) = 2*Ui*(1-2*(t(i)-t0)/tau); %Спад напряжения [В]
        else
            U(i) = 0; %Значение напряжения вне времени длительности сигнала[В] 
        end         
    end    
end


